<script>
  import Item from "./Item.svelte";
</script>

<style type="text/sass">
  .wrap {
    display: flex;
    justify-content: space-between;
    align-items: center;
  }
</style>

<div class="container wrap">
  <Item>
    C 2002 по 2008 год занимался экспертизой промышленной безопасности и
    техническим диагностированием сосудов и аппаратов. Был инженером по
    неразрушающему контролю, методы контроля ВИК, УЗК, ПВК, АЭ.
  </Item>
  <Item>
    С 2002 по текущий день, выполняю работы по расчетам на прочность
    оборудования работающего под давлением, такое как подземные емкости,
    колонное оборудование, абсорберы, адсорберы, теплообменное оборудование и
    т.д.
  </Item>
  <Item>
    С 2017 года увлекся веб разработкой. В 2018, На IoT Хакатоне Ростелекома и
    Майл.ру, разработал API на Node.js для общения IoT устройств между собой.
  </Item>
</div>
